       FD ORDERS-FILE.
       01 ORDER-REGISTRATION.
           05 ORDER-ID PIC 9(6).
           05 ORDER-CUSTOMER-NAME PIC X(50).
           05 ORDER-DATE PIC X(25).
           05 ORDER-STATUS PIC X(25).
           05 PRODUCT-ID PIC 9(6).
           05 PRODUCT-NAME PIC X(40).
           05 QUANTITY PIC 9(3).
           05 PRICE PIC 9(6).
